RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7xx_HAL/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h750xx.s
        PUBWEAK OTG_FS_EP1_OUT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
OTG_FS_EP1_OUT_IRQHandler 
        B OTG_FS_EP1_OUT_IRQHandler 

        PUBWEAK OTG_FS_EP1_IN_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
OTG_FS_EP1_IN_IRQHandler 
        B OTG_FS_EP1_IN_IRQHandler

        PUBWEAK OTG_FS_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
OTG_FS_WKUP_IRQHandler 
        B OTG_FS_WKUP_IRQHandler

        PUBWEAK OTG_FS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
OTG_FS_IRQHandler 
        B OTG_FS_IRQHandler 

        PUBWEAK DMAMUX1_OVR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DMAMUX1_OVR_IRQHandler 
        B DMAMUX1_OVR_IRQHandler 

        PUBWEAK HRTIM1_Master_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HRTIM1_Master_IRQHandler 
        B HRTIM1_Master_IRQHandler 

        PUBWEAK HRTIM1_TIMA_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HRTIM1_TIMA_IRQHandler 
        B HRTIM1_TIMA_IRQHandler 

        PUBWEAK HRTIM1_TIMB_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HRTIM1_TIMB_IRQHandler 
        B HRTIM1_TIMB_IRQHandler 

        PUBWEAK HRTIM1_TIMC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HRTIM1_TIMC_IRQHandler 
        B HRTIM1_TIMC_IRQHandler 

        PUBWEAK HRTIM1_TIMD_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HRTIM1_TIMD_IRQHandler 
        B HRTIM1_TIMD_IRQHandler

        PUBWEAK HRTIM1_TIME_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HRTIM1_TIME_IRQHandler 
        B HRTIM1_TIME_IRQHandler

        PUBWEAK HRTIM1_FLT_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HRTIM1_FLT_IRQHandler 
        B HRTIM1_FLT_IRQHandler

        PUBWEAK DFSDM1_FLT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT0_IRQHandler 
        B DFSDM1_FLT0_IRQHandler 

        PUBWEAK DFSDM1_FLT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT1_IRQHandler 
        B DFSDM1_FLT1_IRQHandler

        PUBWEAK DFSDM1_FLT2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT2_IRQHandler 
        B DFSDM1_FLT2_IRQHandler

        PUBWEAK DFSDM1_FLT3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT3_IRQHandler 
        B DFSDM1_FLT3_IRQHandler	

        PUBWEAK SAI3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SAI3_IRQHandler 
        B SAI3_IRQHandler

        PUBWEAK SWPMI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SWPMI1_IRQHandler 
        B SWPMI1_IRQHandler

        PUBWEAK TIM15_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
TIM15_IRQHandler 
        B TIM15_IRQHandler

        PUBWEAK TIM16_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
TIM16_IRQHandler 
        B TIM16_IRQHandler

        PUBWEAK TIM17_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
TIM17_IRQHandler 
        B TIM17_IRQHandler

        PUBWEAK MDIOS_WKUP_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
MDIOS_WKUP_IRQHandler 
        B MDIOS_WKUP_IRQHandler

        PUBWEAK MDIOS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
MDIOS_IRQHandler 
        B MDIOS_IRQHandler

        PUBWEAK JPEG_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
JPEG_IRQHandler 
        B JPEG_IRQHandler

        PUBWEAK MDMA_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
MDMA_IRQHandler 
        B MDMA_IRQHandler

        PUBWEAK SDMMC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SDMMC2_IRQHandler 
        B SDMMC2_IRQHandler

        PUBWEAK HSEM1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
HSEM1_IRQHandler 
        B HSEM1_IRQHandler

        PUBWEAK ADC3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
ADC3_IRQHandler 
        B ADC3_IRQHandler

        PUBWEAK DMAMUX2_OVR_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DMAMUX2_OVR_IRQHandler 
        B DMAMUX2_OVR_IRQHandler

        PUBWEAK BDMA_Channel0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel0_IRQHandler 
        B BDMA_Channel0_IRQHandler

        PUBWEAK BDMA_Channel1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel1_IRQHandler 
        B BDMA_Channel1_IRQHandler

        PUBWEAK BDMA_Channel2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel2_IRQHandler 
        B BDMA_Channel2_IRQHandler

        PUBWEAK BDMA_Channel3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel3_IRQHandler 
        B BDMA_Channel3_IRQHandler

        PUBWEAK BDMA_Channel4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel4_IRQHandler 
        B BDMA_Channel4_IRQHandler

        PUBWEAK BDMA_Channel5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel5_IRQHandler 
        B BDMA_Channel5_IRQHandler

        PUBWEAK BDMA_Channel6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel6_IRQHandler 
        B BDMA_Channel6_IRQHandler

        PUBWEAK BDMA_Channel7_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
BDMA_Channel7_IRQHandler 
        B BDMA_Channel7_IRQHandler

        PUBWEAK COMP1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
COMP1_IRQHandler 
        B COMP1_IRQHandler

        PUBWEAK LPTIM2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM2_IRQHandler 
        B LPTIM2_IRQHandler

        PUBWEAK LPTIM3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM3_IRQHandler 
        B LPTIM3_IRQHandler

        PUBWEAK LPTIM4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM4_IRQHandler 
        B LPTIM4_IRQHandler

        PUBWEAK LPTIM5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM5_IRQHandler 
        B LPTIM5_IRQHandler	

        PUBWEAK LPUART1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPUART1_IRQHandler 
        B LPUART1_IRQHandler

        PUBWEAK CRS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
CRS_IRQHandler 
        B CRS_IRQHandler

        PUBWEAK SAI4_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SAI4_IRQHandler 
        B SAI4_IRQHandler

        PUBWEAK WAKEUP_PIN_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
WAKEUP_PIN_IRQHandler 
        B WAKEUP_PIN_IRQHandler 
        END
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
